HNGYXA/test1/hc32l021/file/HC32L021_IDE_Rev1.0.0/IDE_PACK/IAR_IDE/config/debugger/XHSC/HC32L021B8UB.svd
                <register>
                    <name>BCLR</name>
                    <description>desc BCLR</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIN00</name>
                            <description>desc PIN00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN01</name>
                            <description>desc PIN01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN02</name>
                            <description>desc PIN02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN03</name>
                            <description>desc PIN03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN04</name>
                            <description>desc PIN04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN05</name>
                            <description>desc PIN05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN06</name>
                            <description>desc PIN06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN07</name>
                            <description>desc PIN07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN08</name>
                            <description>desc PIN08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN09</name>
                            <description>desc PIN09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <description>desc PIN10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <description>desc PIN11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <description>desc PIN12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <description>desc PIN13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <description>desc PIN14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <description>desc PIN15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BSETCLR</name>
                    <description>desc BSETCLR</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BCLRPIN00</name>
                            <description>desc BCLRPIN00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN01</name>
                            <description>desc BCLRPIN01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN02</name>
                            <description>desc BCLRPIN02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN03</name>
                            <description>desc BCLRPIN03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN04</name>
                            <description>desc BCLRPIN04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN05</name>
                            <description>desc BCLRPIN05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN06</name>
                            <description>desc BCLRPIN06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN07</name>
                            <description>desc BCLRPIN07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN08</name>
                            <description>desc BCLRPIN08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN09</name>
                            <description>desc BCLRPIN09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN10</name>
                            <description>desc BCLRPIN10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN11</name>
                            <description>desc BCLRPIN11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN12</name>
                            <description>desc BCLRPIN12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN13</name>
                            <description>desc BCLRPIN13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN14</name>
                            <description>desc BCLRPIN14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCLRPIN15</name>
                            <description>desc BCLRPIN15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN00</name>
                            <description>desc BSETPIN00</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN01</name>
                            <description>desc BSETPIN01</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN02</name>
                            <description>desc BSETPIN02</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN03</name>
                            <description>desc BSETPIN03</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN04</name>
                            <description>desc BSETPIN04</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN05</name>
                            <description>desc BSETPIN05</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN06</name>
                            <description>desc BSETPIN06</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN07</name>
                            <description>desc BSETPIN07</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN08</name>
                            <description>desc BSETPIN08</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN09</name>
                            <description>desc BSETPIN09</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN10</name>
                            <description>desc BSETPIN10</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN11</name>
                            <description>desc BSETPIN11</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN12</name>
                            <description>desc BSETPIN12</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN13</name>
                            <description>desc BSETPIN13</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN14</name>
                            <description>desc BSETPIN14</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BSETPIN15</name>
                            <description>desc BSETPIN15</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PU</name>
                    <description>desc PU</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x6C00</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIN00</name>
                            <description>desc PIN00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN01</name>
                            <description>desc PIN01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN02</name>
                            <description>desc PIN02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN03</name>
                            <description>desc PIN03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN04</name>
                            <description>desc PIN04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN05</name>
                            <description>desc PIN05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN06</name>
                            <description>desc PIN06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN07</name>
                            <description>desc PIN07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN08</name>
                            <description>desc PIN08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN09</name>
                            <description>desc PIN09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <description>desc PIN10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <description>desc PIN11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <description>desc PIN12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <description>desc PIN13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <description>desc PIN14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <description>desc PIN15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
