HNGYXA/test1/hc32l021/file/HC32L021_IDE_Rev1.0.0/IDE_PACK/IAR_IDE/config/debugger/XHSC/HC32L021B8UB.svd
                <register>
                    <name>STAR</name>
                    <description>desc STAR</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>TXNACK</name>
                            <description>desc TXNACK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STDR</name>
                    <description>desc STDR</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>desc DATA</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRDR</name>
                    <description>desc SRDR</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x4000</resetValue>
                    <resetMask>0x0</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>desc DATA</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REMP</name>
                            <description>desc REMP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOF</name>
                            <description>desc SOF</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SADDR</name>
                    <description>desc SADDR</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FE07FE</resetMask>
                    <fields>
                        <field>
                            <name>ADDR0</name>
                            <description>desc ADDR0</description>
                            <msb>10</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDR1</name>
                            <description>desc ADDR1</description>
                            <msb>26</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SASR</name>
                    <description>desc SASR</description>
                    <addressOffset>0x150</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x4000</resetValue>
                    <resetMask>0x0</resetMask>
                    <fields>
                        <field>
                            <name>RADDR</name>
                            <description>desc RADDR</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ANV</name>
                            <description>desc ANV</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
